package homework1;
// Шкирандо Владислав, 21 не решил
import java.util.Scanner;

public class Homework1 {
    private static Object x1;

    public static void main(String[] args) {
        //Begin13 Даны два круга с общим центром и радиусами R1 и R2 (R1 > R2). Найти площади этих кругов S1 и S2, а также площадь S3 кольца, внешний радиус которого равен R1, а внутренний радиус равен R2:
        //S1 = π·(R1)2, S2 = π·(R2)2, S3 = S1 − S2
        /*
        int R1 = 4;
        int R2 = 18;
        //Ищем площадь кругов S1 и S2, а также площадь S3 кольца;
        final double pi = 3.14;
        double S1 = pi * (R1 * R1);
        double S2 = pi * (R2 * R2);
        double S3 =  S1 - S2;
        System.out.println("Площадь круга S1: " + S1 + "    " + "Площадь круга S2; "  + S2 + " " + "Площадь кольца S3:" + S3);*/
        //Begin16 Найти расстояние между двумя точками с заданными координатами x1 и x2 на числовой оси: |x2 − x1|
        /*
        double x1 = 210;
        double x2 = 315;
        double x3 = x2 - x1;
        System.out.println(x3);**/
        //Begin19 Даны координаты двух противоположных вершин прямоугольника: (x1, y1), (x2, y2). Стороны прямоугольника параллельны осям координат.
        //Найти периметр и площадь данного прямоугольника.
        /*
        double x1 = 10;
        double y1 = 20;
        double x2 = 40;
        double y2 = 30;
        final double pi = 3.14;
        double a1 = y1 - y2;
        double a2 = x1- x2;
        double S = a1 * a2;
        double P = 2 * (a1 + a2);
        System.out.println("Периметр прямоугольника: " + P);
        System.out.println("Площадь прямоугольника: " + S);*/
        //Begin20 Найти расстояние между двумя точками с заданными координатами(x1, y1) и (x2, y2) на плоскости. Расстояние вычисляется по формуле q(x2 − x1)2 + (y2 − y1)2;
        /*
        int x1 = 20;
        int y1 = 35;
        int x2 = 40;
        int y2 = 45;
        double p = (x2 - x1) * 2 + (y2 - y1) * 2;
        System.out.println("Расстояние между двумя точками: " + p);*/
        
        
        
              
        
        
       
        
        
        

        
        
        
        
        
                
        
        
                
        
        
        
        
        
        
    }
    
}
